nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Public.c
/********************************************************************************
 * File Name:			public.c
 * Function Describe:	
 * Relate Module:	public.h
 * Writer:				Joneming 
 * Date:				  2013-01-18
 * Rewriter: 			
 * Date:				
 *******************************************************************************/
/****************************************************/
/*                                                  */
/* Included files                                   */
/*                                                  */
/****************************************************/
#include "stm32f10x.h"
#include "stm32f10x_iwdg.h"
#include <string.h>
#include <stdio.h>
#include "Public.h"
#include "Rtc.h"
#include "stm32f10x_rtc.h"
#include "spi_flash_app.h"
#include "spi_flash.h"
#include "fm25c160.h"
#include "SysTick.h"
#include "EepromPram.h"
#include "Rtc.h"
/****************************************************/
/*                                                  */
/* Local Definitions and macros                     */
/*                                                  */
/****************************************************/
enum 
{
    PUBLIC_TIMER_EIEXPAND,					//
    PUBLIC_TIMER_TASK,                      //  
    PUBLIC_TIMER_TEST,						//  
    PUBLIC_TIMER_OPERATE,					//      
    PUBLIC_TIMERS_MAX
}STPUBLICTIME;
static LZM_TIMER s_stPUBLICTimer[PUBLIC_TIMERS_MAX];
///////////////////////////
//static unsigned char s_ucNewCallPhoneFlag = 0;//新来电标志
//////////////////////////////////
#if (USE_SYS_QUEUE == 1) 
#define QUEUE_DATALEN_SYS     40  //队列数据长度
ST_QUEUE g_sutSysQueue;
static QueueData s_QDSysData[QUEUE_DATALEN_SYS];
//中断消息队列(主要用于中断的切换,队列中的值为中断类型，在系统中抽象为消息)
#define QUEUE_DATALEN_INT       40
ST_QUEUE g_sutIntQueue;
static QueueData s_QDIntData[QUEUE_DATALEN_INT];
#endif
/************************************************************
** 函数名称: LZM_QueueClear()initialize the queue
** 功能描述: 清除队列（初始化） queue is initialized to being empty 
** 入口参数: pq points to a queue 
** 出口参数:
************************************************************/ 
void LZM_QueueClear(ST_QUEUE *pq)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    pq->front   = 0;
    pq->rear    = 0;
    pq->count   = 0; 
    #endif
}

/************************************************************
** 函数名称: LZM_QueueEmpty()
** 功能描述: 检查队列是否为空(如果队列满了，怎么办。。。。。)
** 入口参数:
** 出口参数: 0:   非空
			 非0：空
************************************************************/ 
QueueData LZM_QueueEmpty(ST_QUEUE *pq)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    if(pq->rear == pq->front||(0==pq->count))
    {
        pq->count = 0;
        return 1;
    }
    return 0;
    #endif
}

/************************************************************
** 函数名称: LZM_QueueFull()
** 功能描述: 检查队列是否满
** 入口参数:
** 出口参数:
************************************************************/ 
QueueData LZM_QueueFull(ST_QUEUE *pq)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    return (pq->count >= pq->datalen);
    #endif
}
/************************************************************
** 函数名称: LZM_QueueInsert()
** 功能描述: 将数据插入队列
** 入口参数:
** 出口参数:
************************************************************/ 
void LZM_QueueInsert(ST_QUEUE *pq,QueueData qdata)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    if(!LZM_QueueFull(pq))
    {  
        pq->data[pq->rear++] = qdata;
        if(pq->rear >= pq->datalen)
            pq->rear = 0;
        pq->count++;   
    }
    #endif
}

/************************************************************
** 函数名称: LZM_QueueDataBatchInsert
** 功能描述: 数据批量入队
** 入口参数: ST_QUEUE:批量入队队列,dest:目标地址,datalen:数据长度
** 出口参数: 入队的数据长度,
************************************************************/ 
Qu16 LZM_QueueDataBatchInsert(ST_QUEUE *pq,unsigned char *dest,unsigned short datalen)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    Qu16 count,count1;
    if(!LZM_QueueFull(pq))
    {
        if(pq->count + datalen > pq->datalen)
        {
            count = pq->datalen - pq->count;
        }
        else
        {
            count = datalen;
        }
        ////////////////////////////
        if(pq->rear + count > pq->datalen)
        {
            count1 =pq->datalen-pq->rear;
            memcpy(&pq->data[pq->rear],dest,count1);
            memcpy(&pq->data[0],&dest[count1],count-count1);
            pq->rear = count-count1;
        }
        else
        {
            memcpy(&pq->data[pq->rear],dest,count);
            pq->rear +=count;
        }
        //////////////////
        pq->count +=count;
        //////////////////////
        return count;
    }
    return 0;
    #endif
}
/************************************************************
** 函数名称: LZM_QueueDelete()
** 功能描述: 从队列取出数据
** 入口参数:
** 出口参数:
************************************************************/ 
QueueData LZM_QueueDelete(ST_QUEUE *pq)
{   
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    QueueData data;
    data = 0;
    if(!LZM_QueueEmpty(pq))   
    {   
        ///////////////////////////////
        data = pq->data[pq->front];
        /////////////////////////
        if(pq->count)pq->count--;
        pq->front++;
        if(pq->front >= pq->datalen)
            pq->front = 0;
    } 
    ////////////////////////
    return data;
    #endif
}

/************************************************************
** 函数名称: LZM_QueueDataBatchDelete
** 功能描述: 数据批量出队
** 入口参数: ST_QUEUE:批量出队队列,dest:目标地址,maxcount:最长长度,防止dest溢出
** 出口参数: 出队的数据长度,
************************************************************/ 
Qu16 LZM_QueueDataBatchDelete(ST_QUEUE *pq,unsigned char *dest,unsigned short maxcount)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    Qu16 count,count1;
    if(!LZM_QueueEmpty(pq))
    {
        if(pq->rear >= pq->front)
        {
            count = pq->rear -pq->front;
        }
        else
        {
            count = pq->datalen+ pq->rear - pq->front;
        }
        pq->count = count;
        /////////////////////////
        if(count>maxcount)count = maxcount;
        /////////////////////////
        pq->count -= count;
        if(pq->front + count > pq->datalen)
        {
            count1 = pq->datalen - pq->front;
            memcpy(dest,&pq->data[pq->front],count1);
            pq->front = count-count1;
            memcpy(&dest[count1],&pq->data[0],pq->front);
        }
        else
        {
            memcpy(dest,&pq->data[pq->front],count);
            pq->front += count;
        }
        //////////////////////
        return count;
    }
    return 0;
    #endif
}
/************************************************************
** 函数名称: LZM_QueueBackUpParam
** 功能描述: 备份相关队列操作参数
** 入口参数: src源队列,bak暂存队列
** 出口参数:
************************************************************/ 
void LZM_QueueBackUpParam(ST_QUEUE *src,ST_QUEUE *bak)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    bak->datalen    = src->datalen;
    bak->count      = src->count; 
    bak->front      = src->front;
    bak->rear       = src->rear;    
    #endif
}
/************************************************************
** 函数名称: LZM_QueueRecoveryParam
** 功能描述: 恢复相关队列操作参数(注意:队列实际数据根据实际情况,如果没有覆盖到备份前的数据,都可恢复)
** 入口参数: des目标队列,bak暂存队列
** 出口参数:
************************************************************/ 
void LZM_QueueRecoveryParam(ST_QUEUE *des,ST_QUEUE *bak)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    des->datalen    = bak->datalen;
    des->count      = bak->count; 
    des->front      = bak->front;
    des->rear       = bak->rear;    
    #endif
}
/************************************************************
** 函数名称: LZM_QueueDataCount
** 功能描述: 获取队列当前数据总长度
** 入口参数:
** 出口参数:
************************************************************/ 
Qu16 LZM_QueueDataCount(ST_QUEUE *pq)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    return   pq->count; 
    #endif
}

/************************************************************
** 函数名称: LZM_QueueDataFreeSpace
** 功能描述: 获取队列当前数据剩余空间
** 入口参数:
** 出口参数:
************************************************************/ 
Qu16 LZM_QueueDataFreeSpace(ST_QUEUE *pq)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    return   (pq->datalen - pq->count); 
    #endif
}
/************************************************************
** 函数名称: LZM_QueueClear()initialize the queue
** 功能描述: 清除队列（初始化） queue is initialized to being empty 
** 入口参数: pq points to a queue 
** 出口参数:
************************************************************/ 
void LZM_QueueDataInit(ST_QUEUE *pq,QueueData *data,int dataLen)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    pq->data= data;
    pq->datalen = dataLen;
    LZM_QueueClear(pq);
    #endif
}

/************************************************************
** 函数名称: LZM_QueueInit()
** 功能描述: 
** 入口参数:
** 出口参数:
************************************************************/ 
void LZM_QueueInit(void)
{
    #if(QUEUE_TYPE == CIRCULAR_QUEUE)
    #if (USE_SYS_QUEUE==1)
    LZM_QueueDataInit(&g_sutSysQueue,s_QDSysData,QUEUE_DATALEN_SYS);
    LZM_QueueDataInit(&g_sutIntQueue,s_QDIntData,QUEUE_DATALEN_INT);
    #endif
    #endif
}

