nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Public.c
#if(USE_STACK == 1)
/************************************************************
** 函数名称: LZM_StackClear()initialize the stack
** 功能描述: 清除栈（初始化） stack is initialized to being empty 
** 入口参数: ps points to a stack 
** 出口参数:
************************************************************/ 
void LZM_StackClear(ST_STACK *ps)
{
    ps->top = 0;    
    ps->count = 0;
    ps->bottom = 0;
}

/************************************************************
** 函数名称: LZM_StackEmpty()
** 功能描述: 检查栈是否为空(如果队列满了，怎么办。。。。。)
** 入口参数:
** 出口参数: 0:   非空
			 非0：空
************************************************************/ 
StackData LZM_StackEmpty(ST_STACK *ps)
{
    return(0 == ps->count); 
}


/************************************************************
** 函数名称: LZM_StackFull()
** 功能描述: 检查栈是否满
** 入口参数:
** 出口参数: 0:   非满
			 非0：满
************************************************************/ 
StackData LZM_StackFull(ST_STACK *ps)
{
    return (ps->count >= (STACKMAXNUM - 1));
}	  

/************************************************************
** 函数名称: LZM_StackTop
** 功能描述: 将数据从栈顶出栈
** 入口参数:
** 出口参数:
************************************************************/ 
StackData LZM_StackTop(ST_STACK *ps)
{
    StackData data;
    data = 0;
    if(!LZM_StackEmpty(ps))   
    {
        if(ps->top == 0)
            ps->top = STACKMAXNUM;
        ps->top--;
        ps->count--;
        data = ps->data[ps->top];
    }
    return data;
}

/************************************************************
** 函数名称: LZM_StackBottom()
** 功能描述: 将数据从栈底出栈
** 入口参数:
** 出口参数:
************************************************************/ 
StackData LZM_StackBottom(ST_STACK *ps)
{
    StackData data;
    data =0;
    if(!LZM_StackEmpty(ps))   
    { 
        data = ps->data[ps->bottom];
        ps->bottom++;
        if(ps->bottom == STACKMAXNUM)
            ps->bottom = 0;
        ps->count--;
    }
    /////////////////////
    return data;
}
/************************************************************
** 函数名称: LZM_StackPush()
** 功能描述: 将数据入栈
** 入口参数:
** 出口参数:
************************************************************/ 
void LZM_StackPush(ST_STACK *ps,StackData sdata)
{
    if(!LZM_StackFull(ps))   
    { 
        ps->data[ps->top++] = sdata;  
        if(ps->top >= STACKMAXNUM) 
            ps->top = 0;   
        ps->count++;
    }
}
#endif

/*****************************************************
*
*       Public  code
*
*****************************************************/

/************************************************************
** 函数名称: LZM_PublicSetCycTimer
** 功能描述: 重复(循环)定时
** 入口参数: stTimer:定时器指针变量
             value:定时值
             function:需要执行的函数
** 出口参数:
************************************************************/ 
void LZM_PublicSetCycTimer(LZM_TIMER *stTimer,LZM_TIMER32 value,void (*function)(void))
{
    stTimer->enabled  = TIMER_ENABLE;
    stTimer->counter  = value+SysTick_GetCounter();
    stTimer->interval = value;
    stTimer->operate = function;
}
/************************************************************
** 函数名称: LZM_PublicSetOnceTimer
** 功能描述: 单次定时
** 入口参数: stTimer:定时器指针变量
             value:定时值
             function:需要执行的函数
** 出口参数:
************************************************************/ 
void LZM_PublicSetOnceTimer(LZM_TIMER *stTimer,LZM_TIMER32 value,void (*function)(void))
{
    stTimer->enabled  = TIMER_ENABLE;
    stTimer->counter  = value+SysTick_GetCounter();
    stTimer->interval = ONCE;
    stTimer->operate = function;
}
/************************************************************
** 函数名称: LZM_PublicKillTimer
** 功能描述: 关闭指定定时器
** 入口参数: stTimer:定时器指针
** 出口参数:
************************************************************/ 
void LZM_PublicKillTimer(LZM_TIMER *stTimer)
{
    stTimer->enabled  = TIMER_DISENABLE;
}
/************************************************************
** 函数名称: LZM_PublicGetTimerEnable
** 功能描述: 指定定时器是否有效
** 入口参数: stTimer:定时器指针
** 出口参数:
************************************************************/ 
LZM_RET LZM_PublicGetTimerEnable(LZM_TIMER *stTimer)
{
    return (TIMER_ENABLE == stTimer->enabled)? 1 : 0;
}
/************************************************************
** 函数名称: LZM_PublicKillTimerAll
** 功能描述: 关闭所有指定定时器
** 入口参数: stTimes:定时器变量
             maxtimes:定时器最大项
** 出口参数:
************************************************************/ 
void LZM_PublicKillTimerAll(LZM_TIMER *stTimers,unsigned char maxtimes)
{
    unsigned char i;
    for(i = 0; i < maxtimes; i++)
    {
        stTimers[i].enabled = TIMER_DISENABLE;
    }
}
/************************************************************
** 函数名称: LZM_PublicTimerHandler
** 功能描述: 应用程序定时器处理函数
** 入口参数: stTimes:定时器变量
             maxtimes:定时器最大项
** 出口参数:
************************************************************/ 
void LZM_PublicTimerHandler(LZM_TIMER *stTimers,unsigned char maxtimes)
{
    unsigned char i;
    unsigned long timerVal;
    timerVal=SysTick_GetCounter();
    for(i = 0; i < maxtimes; i++)
    {
        if(TIMER_ENABLE == stTimers[i].enabled)
        {
            if(stTimers[i].counter <= timerVal)//
            {
                if(ONCE == stTimers[i].interval)//单次
                {
                    stTimers[i].enabled = TIMER_DISENABLE;
                }
                else//重复定时器
                {
                    stTimers[i].counter += stTimers[i].interval;
                    if(stTimers[i].counter< timerVal)
                        stTimers[i].counter = timerVal;
                }
                //可以在该函数体中重复定义该定时器
                if(NULL != stTimers[i].operate)
                stTimers[i].operate();
            }
        }
    }
}

/*************************************************************
** 函数名称: Public_ConvertStrToASC
** 功能描述: 把字符串的每一个字节用两个16进制数表示(与平台对应)
** 入口参数: des目标数据的首地址,src源数据的首地址,len需要转换的源数据长度
** 出口参数: des目标数据的首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 注意空间分配
*************************************************************/	
void Public_ConvertStrToASC(char * des,const char * src, unsigned short len)
{
    unsigned short i;
    for(i = 0; i < len; i++)
    {
        sprintf(&des[2*i],"%2X",src[i]);
    }
}
/*************************************************************
** 函数名称: Public_ConvertAscToVal
** 功能描述: 把字符'0'~'F'转成0~15的数值
** 入口参数: val:需要转换的数据
** 出口参数: 无
** 返回参数: =0xff转换出错,其它则为转换结果
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char Public_ConvertAscToVal(unsigned char val)
{
    unsigned char temp;
    temp = 0xff;
    if(val>=0x30&&val<=0x39)
    {
        temp = val-0x30;
    }
    else
    if(val>=0x41&&val<=0x46)
    {
        temp = val-0x41+10;
    }
    return temp;
}
/*************************************************************OK
** 函数名称: Public_GetSumVerify
** 功能描述: 对数据块累加求和，只取低字节
** 入口参数: Pdata数据块首地址,datalen长度		 
** 出口参数: 
** 返回参数: 校验码
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char Public_GetSumVerify(const unsigned char *Pdata,unsigned short datalen)
{
    //对数据块累加求和，只取低字节
    unsigned char sum = 0;
    unsigned short  i;
    IWDG_ReloadCounter();//喂狗
    for(i = 0; i < datalen; i++)
    {
        sum += Pdata[i];
    }
    IWDG_ReloadCounter();//喂狗
    return sum;	  
}
/*************************************************************
** 函数名称: Public_GetXorVerify
** 功能描述: 对数据块进行异或，只取低字节
** 入口参数: Pdata数据块首地址,datalen长度		 
** 出口参数: 
** 返回参数: 校验码
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char Public_GetXorVerify(const unsigned char *Pdata,unsigned short datalen)
{
    //对数据块进行异或，只取低字节
    unsigned char Verify ;
    unsigned short  i;
    //////////////////
    Verify= Pdata[0];
    IWDG_ReloadCounter();//喂狗
    for(i = 1; i < datalen; i++)
    {
        Verify ^= Pdata[i];
    }
    IWDG_ReloadCounter();//喂狗
    return Verify;	  
}

