nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Public.c
/*************************************************************
** 函数名称: Public_ConvertAscToBCD
** 功能描述: 把asciii码转成BCD码,(把两个字节的asciii码转成一个字节的BCD码)
** 入口参数: destin目标数据的首地址,source源数据的首地址,len需要转换的源数据长度
** 出口参数: destin目标数据的首地址
** 返回参数: 无
** 全局变量: destin使用时注意destin的空间分配
** 调用模块: 
*************************************************************/	
void Public_ConvertAscToBCD(unsigned char * destin,const unsigned char* source, unsigned char len)
{
    unsigned char i;
    unsigned char chtemp,chhigh,chlow;
    for(i = 0; i < len; i++)
    {
        chtemp = *source++;
        chhigh = chtemp & 0x0F;
        chtemp = *source++;
        chlow = chtemp & 0x0F;
        chhigh <<= 4; 
        chhigh |= chlow;
        *destin++ = chhigh;
    }
}
/*************************************************************
** 函数名称: Public_ConvertBcdToAsc
** 功能描述: 将BCD码字符串每一个字节转换成它的AscII码的字符串
** 入口参数: pAsc转换之后的数据首地址,pBcd需要转换的BCD数据首地址，BcdLen:需要转换的数据长度
** 出口参数: pAsc转换之后的数据首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 注意空间分配
*************************************************************/	
void Public_ConvertBcdToAsc(unsigned char *pAsc, const unsigned char *pBcd, unsigned char BcdLen)
{
    unsigned char	i;
    for(i=0; i<BcdLen; i++)
    {
        *(pAsc+2*i) = (*(pBcd+i) >> 4)+0x30;
        *(pAsc+2*i+1) = (*(pBcd+i) & 0x0f)+0x30;
    }
}
/*************************************************************
** 函数名称: Public_ConvertBcdToValue
** 功能描述: 将BCD码字符串转换成它的值的字符串
** 入口参数: pValue转换之后的数据首地址,pBcd需要转换的BCD数据首地址，BcdLen:需要转换的数据长度
** 出口参数: pValue转换之后的数据首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 注意空间分配
*************************************************************/	
void Public_ConvertBcdToValue(unsigned char *pValue, const unsigned char *pBcd, unsigned char BcdLen)
{
    unsigned char	i;
    for(i=0; i<BcdLen; i++)
    {
        *(pValue+i) = (*(pBcd+i) >> 4)*10+(*(pBcd+i) & 0x0f);
    }
}
/*************************************************************
** 函数名称: Public_ConvertTimeToBCD
** 功能描述: 把时间转成BCD码(7位)
** 入口参数: stTime:需要转换的时间结构体,保存BCD码的首地址
** 出口参数: data:转换之后的数据首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertTimeToBCD(TIME_T stTime,unsigned char * data)
{
    unsigned char buffer[20];
    unsigned char buffer1[20];
    sprintf((char *)buffer,"20%02d%02d%02d%02d%02d%02d",stTime.year,stTime.month,stTime.day,stTime.hour,stTime.min,stTime.sec);
    Public_ConvertAscToBCD(buffer1,buffer,strlen((char *)buffer));
    memcpy(data,buffer1,7);
}
/*************************************************************
** 函数名称: Public_ConvertTimeToBCDEx
** 功能描述: 把时间转成BCD码(6位)
** 入口参数: stTime:需要转换的时间结构体,保存BCD码的首地址
** 出口参数: data:转换之后的数据首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertTimeToBCDEx(TIME_T stTime,unsigned char * data)
{
    unsigned char buffer[20];
    unsigned char buffer1[20];
    sprintf((char *)buffer,"%02d%02d%02d%02d%02d%02d",stTime.year,stTime.month,stTime.day,stTime.hour,stTime.min,stTime.sec);
    Public_ConvertAscToBCD(buffer1,buffer,strlen((char *)buffer));
    memcpy(data,buffer1,6);
}
/*************************************************************
** 函数名称: Public_ConvertNowTimeToBCD
** 功能描述: 把当前时间转成BCD码(7位)
** 入口参数: 保存BCD码的首地址
** 出口参数: data:转换之后的数据首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertNowTimeToBCD(unsigned char * data)
{
    TIME_T now_time;
    RTC_ReadTime(&now_time);
    Public_ConvertTimeToBCD(now_time,data);
}
/*************************************************************
** 函数名称: Public_ConvertNowTimeToBCDEx
** 功能描述: 把当前时间转成BCD码(6位)
** 入口参数: 保存BCD码的首地址
** 出口参数: data:转换之后的数据首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertNowTimeToBCDEx(unsigned char * data)
{
    TIME_T now_time;
    RTC_ReadTime(&now_time);
    Public_ConvertTimeToBCDEx(now_time,data);
}
/*************************************************************
** 函数名称: Public_CheckTimeStruct
** 功能描述: 检查时间结构体内的值是否正确
** 入口参数: 检查时间结构体的首地址
** 出口参数: 
** 返回参数: 正确，返回1，错误返回0
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char Public_CheckTimeStruct(TIME_T *tt)
{
    //检查年、月、日、时、分、秒时间参数
    if((tt->year > END_YEAR)||(tt->year < 0)||
    (tt->month > 12)||(tt->month < 1)||
    (tt->day > 31)||(tt->day < 1)||
    (tt->hour > 23)||(tt->hour < 0)||
    (tt->min > 59)||(tt->min < 0)||
    (tt->sec > 59)||(tt->sec < 0))
    {
        return 0;
    }
    else
    {
        return 1;
    }
}
/*************************************************************
** 函数名称: Public_ConvertBCDToTime
** 功能描述: 把BCD码(6位)转成时间格式
** 入口参数: BCD码的首地址
** 出口参数: stTime:转换之后的结果(转换成功才赋值)
** 返回参数: 1转换成功,0出错
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char Public_ConvertBCDToTime(TIME_T *stTime,unsigned char * data)
{
    unsigned char buffer[20];
    Public_ConvertBcdToValue(buffer,data,6);
    if(Public_CheckTimeStruct((TIME_T *)buffer))
    {
        memcpy(stTime, buffer,6);
        return 1;
    }
    return 0;
}
/*************************************************************
** 函数名称: Public_ConvertBCDToTimeEx
** 功能描述: 把BCD码(6位)转成时间格式
** 入口参数: BCD码的首地址
** 出口参数: stTime:转换之后的结果,不判断结果
** 返回参数:  
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertBCDToTimeEx(TIME_T *stTime,unsigned char * data)
{
    unsigned char buffer[20];
    Public_ConvertBcdToValue(buffer,data,6);
    memcpy(stTime, buffer,6);
}
/*************************************************************
** 函数名称: Public_ConvertLongToBuffer
** 功能描述: 把unsigned long转成4位unsigned char,高位在前
** 入口参数: value:需要转换的数据
** 出口参数: buf:转换结果的首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertLongToBuffer(unsigned long value,unsigned char *buf)
{
    unsigned char i;
    for(i= 0; i<4; i++)
    {
        buf[3-i]=value>>(i<<3);
    }
}
/*************************************************************
** 函数名称: Public_ConvertBufferToLong
** 功能描述: 把4位unsigned char,高位在前的数据转成unsigned long;
             (与Public_ConvertLongToBuffer功能相反)
** 入口参数: buf:需要转换的数据的首地址
** 出口参数: 
** 返回参数: 转换结果
** 全局变量: 
** 调用模块: 
*************************************************************/
unsigned long Public_ConvertBufferToLong(unsigned char *buf)
{
    unsigned long value;
    value = 0;
    value |= buf[0]<<24;
    value |= buf[1]<<16;
    value |= buf[2]<<8;
    value |= buf[3];
    return value;
}
/*************************************************************
** 函数名称: Public_ConvertBufferToShort
** 功能描述: 把2位unsigned char,高位在前的数据转成unsigned short;
** 入口参数: buf:需要转换的数据的首地址
** 出口参数: 
** 返回参数: 转换结果
** 全局变量: 
** 调用模块: 
*************************************************************/
unsigned short Public_ConvertBufferToShort(unsigned char *buf)
{
    unsigned short value;
    value = 0;
    value |= buf[0]<<8;
    value |= buf[1];
    return value;
}
/*************************************************************
** 函数名称: Public_ConvertShortToBuffer
** 功能描述: 把unsigned short转成2位unsigned char,高位在前
** 入口参数: value:需要转换的数据
** 出口参数: buf:转换结果的首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertShortToBuffer(unsigned short value,unsigned char *buf)
{
    buf[0] = value>>8;
    buf[1] = value&0xff;
}
/*************************************************************
** 函数名称: Public_BCD2HEX
** 功能描述: BCD转换为Byte        
** 入口参数: val:需要转换的数据
** 出口参数: 无
** 返回参数: 转换结果
** 全局变量: 
** 调用模块: 
*************************************************************/
unsigned char Public_BCD2HEX(unsigned char val)    //BCD转换为Byte
{
    unsigned char temp;
    temp=val&0x0f;
    val>>=4;
    val&=0x0f;
    val*=10;
    temp+=val;
   
    return temp;
}
/*************************************************************
** 函数名称: Public_HEX2BCD
** 功能描述: Byte码转换为BCD码    
** 入口参数: val:需要转换的数据
** 出口参数: 无
** 返回参数: 转换结果
** 全局变量: 
** 调用模块: 
*************************************************************/
unsigned char Public_HEX2BCD(unsigned char val)    //Byte码转换为BCD码
{
    unsigned char i,j,k;
    i=val/10;
    j=val%10;
    k=j+(i<<4);
    return k;
}
/*************************************************************
** 函数名称: Public_ConvertTwoAscToOneChar
** 功能描述: 把两个字符合成数值(把字符'0'~'F'转成0~15的数值)
** 入口参数: src:两个字符的首地址
** 出口参数: result:转换结果
** 返回参数: 0:转换出错,1转换成功
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char Public_ConvertTwoAscToOneChar(const unsigned char *val,unsigned char *result)
{
    unsigned char temp,temp1;
    temp1=Public_ConvertAscToVal(val[0]);
    if(temp1==0xff)return 0;
    temp=Public_ConvertAscToVal(val[1]);
    if(temp==0xff)return 0;
    /////////////////
    temp1=temp1*16+temp;
    *result=temp1;
    return 1;
}
/*************************************************************
** 函数名称: Public_CheckStrIsBCD
** 功能描述: 判断字符是否为BCD码，若是,则返回相应的数值,若不是:则返回0xff
** 入口参数: val:需要转换的数据
** 出口参数: 无
** 返回参数: =0xff转换出错,其它则为转换结果
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char Public_CheckStrIsBCD(unsigned char val)
{
    unsigned char temp,temp1;
    temp=val/16;
    temp1=val%16;
    if(temp>9||temp1>9)
    {
        return 0xff;
    }
    else
    {
        return (temp*10+temp1);
    }
}
/*************************************************************
** 函数名称: Public_ConvertShortToBCD
** 功能描述: 把short类数据转成BCD(2位BCD,不足的前面补0)
** 入口参数: val数据不大于9999,buffer转换结果的首地址
** 出口参数: buffer转换结果的首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertShortToBCD(unsigned short val,unsigned char *buffer)
{
    unsigned char temp[20],temp1[20];  
    if(val>9999) val = 9999;
    sprintf((char *)temp,"%04d",val);
    Public_ConvertAscToBCD(temp1,temp,4);
    memcpy(buffer,temp1,2);
}
/*************************************************************
** 函数名称: Public_ConvertShortToBCDEx
** 功能描述: 把short类数据转成BCD(3位BCD,不足的前面补0)
** 入口参数: val数据,buffer转换结果的首地址
** 出口参数: buffer转换结果的首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertShortToBCDEx(unsigned short val,unsigned char *buffer)
{
    unsigned char temp[20],temp1[20];  
    sprintf((char *)temp,"%06d",val);
    Public_ConvertAscToBCD(temp1,temp,6);
    memcpy(buffer,temp1,3);
}
/*************************************************************
** 函数名称: Public_ConvertBCDToShort
** 功能描述: 把2位BCD转成Short类数据
** 入口参数: buffer首地址
** 出口参数: 无
** 返回参数: 转换之后的数值
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned short Public_ConvertBCDToShort(unsigned char *buffer)
{
    unsigned char data[20];
    unsigned short val;
    Public_ConvertBcdToValue(buffer,data,4);
    val=100ul*data[0]+data[1];
    return val;
}
/*************************************************************
** 函数名称: Public_ConvertLongToBCD
** 功能描述: 把long类数据转成BCD(4位BCD,不足的前面补0)
** 入口参数: val数据不大于99999999,buffer转换结果的首地址
** 出口参数: buffer转换结果的首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertLongToBCD(unsigned long val,unsigned char *buffer)
{
    unsigned char temp[20],temp1[20];
    if(val>99999999) val = 99999999;
    sprintf((char *)temp,"%08d",val);
    Public_ConvertAscToBCD(temp1,temp,8);
    memcpy(buffer,temp1,4);
}
/*************************************************************
** 函数名称: Public_ConvertLongToBCDEx
** 功能描述: 把long类数据转成BCD(5位BCD,不足的前面补0)
** 入口参数: val数据,buffer首地址
** 出口参数: buffer转换结果的首地址
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Public_ConvertLongToBCDEx(unsigned long val,unsigned char *buffer)
{
    unsigned char temp[20],temp1[20];
    sprintf((char *)temp,"%010d",val);
    Public_ConvertAscToBCD(temp1,temp,10);
    memcpy(buffer,temp1,5);
}
/*************************************************************
** 函数名称: Public_ConvertBCDToLong
** 功能描述: 把4位BCD转成long类数据
** 入口参数: buffer需要转换数据的首地址
** 出口参数: 转换结果
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/
unsigned long Public_ConvertBCDToLong(const unsigned char *buffer)
{
    unsigned char data[20];
    unsigned long val;
    Public_ConvertBcdToValue(data,buffer,4);
    val=1000000ul*data[0]+10000ul*data[1]+100ul*data[2]+data[3];
    return val;
}
/*************************************************************
** 函数名称: Public_CheckArrayValIsEqual
** 功能描述: 判断两个数组是否相等,
** 入口参数: array需要判断的数组1首地址,array1需要判断的数组2首地址,len需要判断的长度
** 出口参数: 无
** 返回参数: 0相等,1不相等;
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char Public_CheckArrayValIsEqual(const unsigned char *array,const unsigned char *array1,unsigned short len)
{
    unsigned short i;
    for(i =0; i <len; i++)
    {
        if(array[i]!=array1[i])return 1;
    }
    return 0;
}

