nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Public.c
/*************************************************************
** 函数名称: Public_PlayTTSVoiceAlarmStr
** 功能描述: 分段播放语音,报警信息
** 入口参数: 需要播放的语音首地址
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
/* dxl,2014.8.8 按照黎工提交修改
void Public_PlayTTSVoiceAlarmStr(const u8 *StrPtr)
{
    if(Modem_Api_Tts_IsSpt())//dxl,2014.6.11增加内置tts时修改
    {
        Modem_Api_Tts_Play(0,(u8 *)StrPtr,0);
    }
    else
    {
        PlayMulTTSVoiceAlarmStr((u8 *)StrPtr);
    }
}
*/
/*
void Public_PlayTTSVoiceAlarmStr(const u8 *StrPtr)
{
    PlayMulTTSVoiceAlarmStr((u8 *)StrPtr);
}
*/
/*************************************************************
** 函数名称: Public_PlayE2ParamAlarmVoice
** 功能描述: 播放保存在E2参数中的报警信息语音(存储的语音不超过50个字节)
** 入口参数: 参数ID
** 出口参数: 
** 返回参数: 0:语音读取出错,1语音读取正确
** 全局变量: 无
** 调用模块: 无
*************************************************************/
/*dxl,2015.8
unsigned char Public_PlayE2ParamAlarmVoice(unsigned short ParamID)
{
    unsigned char len;
    unsigned char buffer[51];
    len=EepromPram_ReadPram(ParamID, buffer);
    if(len)
    {
        buffer[len]=0;
        Public_PlayTTSVoiceAlarmStr(buffer);
        return 1;
    }
    return 0;
}
*/
/*************************************************************
** 函数名称: Public_PlayTTSVoiceStr
** 功能描述: 分段播放语音,普通信息
** 入口参数: 需要播放的语音首地址
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
/* dxl,2014.8.8按照黎工提交的修改
void Public_PlayTTSVoiceStr(const u8 *StrPtr)
{
    if(Modem_Api_Tts_IsSpt())//dxl,2014.6.11增加内置tts时修改
    {
        Modem_Api_Tts_Play(0,(u8 *)StrPtr,0);
    }
    else
    {
        PlayMulTTSVoiceStr((u8 *)StrPtr);
    }
}
*/
/*
void Public_PlayTTSVoiceStr(const u8 *StrPtr)
{
    PlayMulTTSVoiceStr((u8 *)StrPtr);
}
*/
/*************************************************************
** 函数名称: Public_WriteDataToFRAM
** 功能描述: 往铁电里写数据,在数据某尾加入校验字节
** 入口参数: address:铁电地址;data:数据首地址;datalen:写入的字节数
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: FRAM_BufferWrite
*************************************************************/
void Public_WriteDataToFRAM(unsigned short address,const unsigned char *data, unsigned short datalen)
{
    FRAM_BufferWrite(address,(unsigned char *)data,datalen);
}
/*************************************************************
** 函数名称: Public_ReadDataFromFRAM
** 功能描述: 从铁电里读数据
** 入口参数: address:铁电地址;data:目标数据首地址;datalen:读出的字节数
** 出口参数: data
** 返回参数: 实际读出的字节数
** 全局变量: 无
** 调用模块: FRAM_BufferRead
*************************************************************/
unsigned short Public_ReadDataFromFRAM(unsigned short address,unsigned char *data, unsigned short datalen)
{
    return FRAM_BufferRead(data,datalen,address);
}
/*************************************************************OK
** 函数名称: Public_GetCurBasicPositionInfo
** 功能描述: 获得当前基本位置信息(上报格式)
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: Report_GetBasicPositionInformation
*************************************************************/
/*
void Public_GetCurBasicPositionInfo(unsigned char *data)
{
    Report_GetPositionBasicInfo(data); //加载位置信息
}
*/
/*************************************************************
** 函数名称: Public_GetCurTotalMile
** 功能描述: 获取总里程(已考虑了速度类型，不需再判断速度类型了)
** 入口参数: 
** 出口参数: 
** 返回参数: 单位是0.1公里
** 全局变量: 无
** 调用模块:
*************************************************************/
/*
unsigned long Public_GetCurTotalMile(void)
{
	
    unsigned long CurrentMile;
    if(SpeedMonitor_GetCurSpeedType())
    {
        CurrentMile = MileMeter_GetTotalMile();        
    }
    else
    {
        CurrentMile = Pulse_GetTotalMile();
    }
    CurrentMile /=10;
    return CurrentMile;
}
*/
/*************************************************************
** 函数名称: Public_Mymemcpy
** 功能描述: src的数据拷到des中,n为拷贝长度,flag为方向(1:倒序,0:顺序)
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
*************************************************************/
void *Public_Mymemcpy(void *des,  const void *src, unsigned short len, unsigned char flag)
{
    //copy char src[len] to des[len] in any order //
    char *su1 = (char *)des;
    const char *su2 = (const char *)src;
    unsigned short i;
    IWDG_ReloadCounter();//喂狗
    if(flag==0)
    {
        for (; 0 < len; ++su1, ++su2, --len)
            *su1 = *su2;
    }
    else
    {
        for(i=0 ;i<len; i++)
        {
            *(su1+len-1-i) = *(su2+i);
        }	
    }
    IWDG_ReloadCounter();//喂狗
    return (des);
}
/*************************************************************
** 函数名称: Public_GetCurPositionInfoDataBlock
** 功能描述: 取得当前位置信息(纬度、经度、高度:表A.20 位置信息数据块格式)
** 入口参数: 返回数据的首地址
** 出口参数: 返回数据的首地址
** 返回参数: 数据长度
** 全局变量: 无
** 调用模块: 无
*************************************************************/
/*
unsigned char Public_GetCurPositionInfoDataBlock(unsigned char *buffer)
{
    unsigned char len;
    signed long slVal;
    GPS_STRUCT stTmpGps;
    Gps_CopygPosition(&stTmpGps);
    //////////////////////////////
    len = 0;
    //////////////////////////
    slVal=stTmpGps.Longitue_D*600000ul+stTmpGps.Longitue_F*10000ul+stTmpGps.Longitue_FX;
    if(!stTmpGps.East)slVal *= -1;
    buffer[len++] = slVal>>24;
    buffer[len++] = slVal>>16;
    buffer[len++] = slVal>>8;
    buffer[len++] = slVal;
    /////////////////
    slVal=stTmpGps.Latitue_D*600000ul+stTmpGps.Latitue_F*10000ul+stTmpGps.Latitue_FX;
    if(!stTmpGps.North)slVal *= -1;   
    buffer[len++] = slVal>>24;
    buffer[len++] = slVal>>16;
    buffer[len++] = slVal>>8;
    buffer[len++] = slVal;
    
    buffer[len++] = stTmpGps.High>>8;
    buffer[len++] = stTmpGps.High; 
    return len;
}
*/
/*************************************************************OK
** 函数名称: Public_ShowTextInfo
** 功能描述: 即时显示文本信息(显示多行字,清屏),定时返回显示之前的界面 
** 入口参数: msg字符串首地址,time:显示时间
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: LcdShowMsgEx
*************************************************************/
void Public_ShowTextInfo(u8 *msg,u32 timeVal)
{
    #ifdef NEW_LCD_DRIVER_GDI
    LcdShowMsgEx(msg,timeVal);
    #else
    #ifdef USE_NAVILCD
    NaviLcdShowTempText((unsigned char*)msg);
    #endif
    #endif
}
/*************************************************************
** 函数名称: Public_ShowSaveDataProBar
** 功能描述: 显示存储进度
** 入口参数: 百分比(从0开始,1.0结束显示,取值:0.0~1.0)
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void Public_ShowSaveDataProBar(float persent)
{
    #ifdef NEW_LCD_DRIVER_GDI
    char buffer[20];
    unsigned char val;
    static unsigned char x0,x;
    if(persent==0.0)
    {
        x0=x=12;
        LcdCopyScreen();
        LcdClearScreen();
        LcdShowCaption("数据转存中", 2);
        LcdShowWindow(10, 22, 115, 31);
        LcdShowWindow(12, 24, 112, 29);
        LcdShowStr(48, 36, "  0%", 0);
        return;
    }
    ////////////////////////////
    val =(unsigned char)(persent*100.0);
    if(val > 100)val=100;
    x= 12 + val;
    LcdShowHorLine(x0+1, x+1, 26, 0);  
    LcdShowHorLine(x0+1, x+1, 27, 0);    
    x0=x;
    sprintf(buffer,"%3d",val);    
    LcdShowStr(48, 36, buffer, 0);
    if(val>=100)LcdPasteScreen();
    #endif
}

