nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Public.c
/*******************************************************************************
**  函数名称  : Public_SetCarLoadStatus
**  函数功能  : 车辆载货状态 
**  输    入  : status: 0：空载、1：半载、2：满载
**  输    出  : 
**  全局变量  : 
**  调用函数  : SetEvTask(EV_REPORT);Io_WriteStatusBit
**  中断资源  : 
**  备    注  :
*******************************************************************************/
/*
void Public_SetCarLoadStatus(unsigned char status)
{
    if(0==status)
    {
        Io_WriteStatusBit(STATUS_BIT_FULL_LOAD1,RESET);
        Io_WriteStatusBit(STATUS_BIT_FULL_LOAD2,RESET);
    }
    else
    if(1==status)
    {
        Io_WriteStatusBit(STATUS_BIT_FULL_LOAD1,SET);
        Io_WriteStatusBit(STATUS_BIT_FULL_LOAD2,RESET);
    }
    else
    if(2==status)
    {
        Io_WriteStatusBit(STATUS_BIT_FULL_LOAD1,SET);
        Io_WriteStatusBit(STATUS_BIT_FULL_LOAD2,SET);
    }
    //SetEvTask(EV_REPORT);
    Report_UploadPositionInfo(CHANNEL_DATA_1);
    Report_UploadPositionInfo(CHANNEL_DATA_2);
}
*/
/*******************************************************************************
**  函数名称  : Public_QuickOpenAccount
**  函数功能  : 快速开户
**  输    入  : 
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
/*
void Public_QuickOpenAccount(void)
{
    ///请在这里添加快速开户实际发送函数/////////    
    #ifdef USE_QUICK_OPEN_ACCOUNT
    OpenAccount_CheckAndDisposeLockStatus();
    #endif
}
*/
/*************************************************************
** 函数名称: Public_ConvertTimeToLong
** 功能描述: 把时间结构体根据控制域转成long型
** 入口参数: ctrl:周期控制域(详见索美格式),stTime需要转换的时间结构体
** 出口参数: 
** 返回参数: 转换结果(0:周期控制域为0,不起作用;非0,起作用) 
** 全局变量: 无
** 调用模块:
*************************************************************/
unsigned long Public_ConvertTimeToLong(unsigned short ctrl,TIME_T stTime)
{
    unsigned long Temp=0;
    ///////////////////////
    if(0==ctrl)return 0;////
    ///////////////////////////
    if(PUBLIC_CHECKBIT(ctrl, 0))//日期时间范围
    {
        Temp = stTime.year; //获得年
        Temp = Temp*12 + stTime.month; //获得月
        Temp = Temp*31 + stTime.day; //获得日
        Temp = Temp*24 + stTime.hour; //获得时
        Temp = Temp*60 + stTime.min; //获得分
        Temp = Temp*60 + stTime.sec; //获得秒
    }
    else
    if(PUBLIC_CHECKBIT(ctrl, 1))//日期范围
    {
        Temp = stTime.year; //获得年
        Temp = Temp*12 + stTime.month; //获得月
        Temp = Temp*31 + stTime.day; //获得日
    }
    else
    if(PUBLIC_CHECKBIT(ctrl, 2))//时间范围
    {
        Temp = Temp*24 + stTime.hour; //获得时
        Temp = Temp*60 + stTime.min; //获得分
        Temp = Temp*60 + stTime.sec; //获得秒
    }
    else
    if(PUBLIC_CHECKBIT(ctrl, 3))//日月范围
    {
        Temp = Temp*12 + stTime.month; //获得月
        Temp = Temp*31 + stTime.day; //获得日
    }
    else
    if(PUBLIC_CHECKBIT(ctrl, 4))//保留
    {
    }
    else
    if(PUBLIC_CHECKBIT(ctrl, 5))//日
    {
        Temp = Temp*31 + stTime.day; //获得日
    }
    else
    if(PUBLIC_CHECKBIT(ctrl, 6))//月
    {
        Temp = Temp*12 + stTime.month; //获得月
    }
    else
    if(PUBLIC_CHECKBIT(ctrl, 7))//年
    {
        Temp = stTime.year; //获得年
    }
    /////////////////
    Temp++;//保证返回结果不再为0
    ///////////////////
    return Temp;
}
/*************************************************************
** 函数名称: Public_ConvertBCDTimeToLong
** 功能描述: 把BCD码(6位)根据控制域转成long型
** 入口参数: ctrl:周期控制域(详见索美格式),data需要转换的BCD码首地址
** 出口参数: 
** 返回参数: 0:表示转换出错或不需要转换,非0:正常的转换结果 
** 全局变量: 无
** 调用模块:
*************************************************************/
unsigned long Public_ConvertBCDTimeToLong(unsigned short ctrl,unsigned char *data)
{
    TIME_T stTime;
    if(0==ctrl)return 0;
    Public_ConvertBCDToTimeEx(&stTime,data);
    return Public_ConvertTimeToLong(ctrl,stTime);//返回结果非0
}
/*************************************************************
** 函数名称: Public_CheckTimeRangeIsValid
** 功能描述: 判断指定时间范围是否有效
** 入口参数: ctrl:周期控制域(详见索美格式),startTime范围开始时间点(经过Public_ConvertTimeToLong转换的值),endTime范围结束时间点(经过Public_ConvertTimeToLong转换的值)
** 出口参数: 
** 返回参数: 1:有效，0:无效
** 全局变量: 无
** 调用模块: 
*************************************************************/
unsigned char Public_CheckTimeRangeIsValid(unsigned short ctrl,unsigned long startTime,unsigned long endTime)
{
    if((0==startTime)||(0==endTime))return 0;
    if(startTime==endTime)
    {
        if(PUBLIC_CHECKBIT(ctrl, 0)||PUBLIC_CHECKBIT(ctrl, 2))//日期时间范围
        return 0;
    }
    return 1;
}
/*************************************************************
** 函数名称: Public_ConvertWeekDay
** 功能描述: 转换星期
** 入口参数: flag转换标志,0:某星期有效时,夜间时间段范围为某星期早上和晚上,分两个时间段,不连续
                          1:某星期有效时,夜间时间段范围为某星期晚上及第二天的早上,为一个连续的时间段
             week星期,startTime范围开始时间点(经过Public_ConvertTimeToLong转换的值),endTime范围结束时间点(经过Public_ConvertTimeToLong转换的值)
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 
*************************************************************/
unsigned char Public_ConvertWeekDay(unsigned char flag,unsigned char week,TIME_T stTime,unsigned long startTime,unsigned long endTime)
{
    unsigned char result;
    result=week;
    /////根据标志采用哪一种方案/////////////
    if(0==flag)return result;////某星期有效时,夜间时间段范围为某星期早上和晚上,分两个时间段,不连续
    /////////////////
    if(startTime>endTime&&stTime.hour<12)//某星期有效时,夜间时间段范围为某星期晚上及第二天的早上,为一个连续的时间段
    {
        if(1==result)
        {
            result=7;
        }
        else
        {
           result=week-1;
        }
    }
    return result;
}
/*************************************************************
** 函数名称: Public_CheckTimeIsInRange
** 功能描述: 判断指定时间是否在指定范围内
** 入口参数: curTime指定时间,startTime开始时间,endTime结束时间
** 出口参数: 
** 返回参数: 1:在范围内，0:不在范围内 
** 全局变量: 无
** 调用模块: 
*************************************************************/
unsigned char Public_CheckTimeIsInRange(unsigned long curTime,unsigned long startTime,unsigned long endTime)
{
    if(startTime<endTime)//小于
    {
        if(startTime<=curTime&&curTime<=endTime)return 1;
    }
    else//大于
    if(startTime>endTime)//
    {
        if(startTime<=curTime||curTime<=endTime)return 1;
    }
    else
    if(startTime==endTime)//等于
    {
        if(startTime==curTime)return 1;
    }
    return 0;
}
/*************************************************************
** 函数名称: Public_CheckCurTimeIsInTimeRange
** 功能描述: 判断当前时间是否在指定时间范围内
** 入口参数: ctrl:周期控制域(详见索美格式),startTime范围开始时间点(经过Public_ConvertTimeToLong转换的值),endTime范围结束时间点(经过Public_ConvertTimeToLong转换的值)
** 出口参数: 
** 返回参数: 1:在范围内，0:不在范围内 
** 全局变量: 无
** 调用模块: Public_ConvertTimeToLong,RTC_GetCurWeekDay
*************************************************************/
/*
unsigned char Public_CheckCurTimeIsInTimeRange(unsigned short ctrl,unsigned long startTime,unsigned long endTime)
{
    unsigned char temp,week;
    unsigned long curTime;
    TIME_T stTime;
    if(!Public_CheckTimeRangeIsValid(ctrl,startTime,endTime))return 0;
    RTC_ReadTime(&stTime);
    temp=(ctrl & 0xff00)>>8;
    if(temp)//需要检查星期
    {
        week = RTC_GetCurWeekDay();
        week = Public_ConvertWeekDay(0,week,stTime,startTime,endTime);
        if(!PUBLIC_CHECKBIT(temp, week-1))return 0;//
    }
    ////////////////////////////    
    curTime=Public_ConvertTimeToLong(ctrl,stTime);
    return Public_CheckTimeIsInRange(curTime,startTime,endTime);
}
*/
/*************************************************************
** 函数名称: Public_CheckTimeIsInTimeRange
** 功能描述: 判断指定时间是否在指定时间范围内
** 入口参数: ctrl:周期控制域(详见索美格式),checkTime需要判断的时间点(四个字节的时间),startTime(经过Public_ConvertTimeToLong转换的值),endTime范围结束时间点(经过Public_ConvertTimeToLong转换的值)
** 返回参数: 1:在范围内，0:不在范围内 
** 全局变量: 无
** 调用模块: Public_ConvertTimeToLong,RTC_CacWeekDay
*************************************************************/
/*
unsigned char Public_CheckTimeIsInTimeRange(unsigned short ctrl,unsigned long checkTime,unsigned long startTime,unsigned long endTime)
{
    unsigned char temp,week;
    unsigned long curTime;
    TIME_T stTime;    
    if(!Public_CheckTimeRangeIsValid(ctrl,startTime,endTime))return 0;
    //////////////////////////
    Gmtime(&stTime,checkTime);
    /////////////////////////
    temp=(ctrl & 0xff00)>>8;
    if(temp)//需要检查星期
    {
        week = RTC_CacWeekDay(stTime.year,stTime.month,stTime.day);
        week = Public_ConvertWeekDay(0,week,stTime,startTime,endTime);
        if(!PUBLIC_CHECKBIT(temp, week-1))return 0;//
    }
    ////////////////////////////
    curTime=Public_ConvertTimeToLong(ctrl,stTime);
    /////////////////////////
    return Public_CheckTimeIsInRange(curTime,startTime,endTime);
}
*/
/*************************************************************
** 函数名称: Public_CheckCurTimeIsInEarlyAlarmTimeRange
** 功能描述: 判断当前时间是否在指定时间的提前范围内
** 入口参数: ctrl:周期控制域(详见索美格式),earlyTime提前时间,startTime范围开始时间点(经过Public_ConvertTimeToLong转换的值),endTime范围结束时间点(经过Public_ConvertTimeToLong转换的值)
** 出口参数: 
** 返回参数: 1:在范围内，0:不在范围内 
** 全局变量: 无
** 调用模块: Public_CheckTimeIsInTimeRange
*************************************************************/
/*
unsigned char Public_CheckCurTimeIsInEarlyAlarmTimeRange(unsigned short ctrl,unsigned long earlyTime,unsigned long startTime,unsigned long endTime)
{
    unsigned long checktime;
    checktime=RTC_GetCounter();
    checktime += earlyTime;
    return Public_CheckTimeIsInTimeRange(ctrl,checktime,startTime,endTime);
}
*/
/*******************************************************************************
**  函数名称  : Public_ShowValue
**  函数功能  : 显示数值
**  输    入  : x,y,format格式,value数值
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
void Public_ShowValue(unsigned char x,unsigned char y,char *format ,unsigned long value)
{
    #ifdef NEW_LCD_DRIVER_GDI
    char buffer[30];
    sprintf(buffer,format,value);
    LcdShowStr(x,y, buffer, 0);
    #endif
}
/*******************************************************************************
**  函数名称  : Public_LcdShowTime
**  函数功能  : 显示时间
**  输    入  : y坐标,stTime时间结构体
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
void Public_LcdShowTime(unsigned char y,TIME_T stTime)
{
    #ifdef NEW_LCD_DRIVER_GDI
    char buffer[20];
    sprintf(buffer,"%02d-",stTime.year);
    LcdShowStr(0,y,buffer,0);
    sprintf(buffer,"%02d-",stTime.month);
    LcdShowStr(23,y,buffer,0);
    sprintf(buffer,"%02d",stTime.day);
    LcdShowStr(46,y,buffer,0);
    sprintf(buffer,"%02d:%02d:%02d",stTime.hour,stTime.min,stTime.sec);
    LcdShowStr(67,y,buffer,0);
    #endif
}
/*************************************************************
** 函数名称: Public_CheckIsPhoneServerRunStatus
** 功能描述: 判断是否为电话服务的行驶状态
** 入口参数: 
** 出口参数: 
** 返回参数: 1为电话服务的行驶状态,0:非电话服务的行驶状态
** 全局变量: 
** 调用模块: 
*************************************************************/
/*
unsigned char Public_CheckIsPhoneServerRunStatus(void)
{
    #ifdef E2_RUN_FORBID_CALL_SWITCH_ID 
    unsigned char flag;
    if(EepromPram_ReadPram(E2_RUN_FORBID_CALL_SWITCH_ID,&flag))
    {
        if(1==flag)
        {
            if((Gps_ReadSpeed()>5)||(Pulse_GetSecondSpeed()>5))
            {
                return 1;//
            }
        }
    }
    #else
    #if (MOD_TYPE == CDMA_MODULE_MC8331) 
    if((Gps_ReadSpeed()>5)||(Pulse_GetSecondSpeed()>5))
    {
        return 1;//
    }
    #endif
    #endif
    return 0;
}
*/
/*************************************************************
** 函数名称: Public_CheckPhoneIsSpecialNumber
** 功能描述: 判断是否为特殊号码
** 入口参数: 
** 出口参数: 
** 返回参数: 0:非特殊号码,非0:为特殊号码,
** 全局变量: 
** 调用模块: 
*************************************************************/
/*
unsigned char Public_CheckPhoneIsSpecialNumber(unsigned char *phone)
{
    unsigned char buffer[30];
    unsigned char len;
    if(!strlen((char *)phone))return 0;
    len = EepromPram_ReadPram(E2_MONITOR_SERVER_PHONE_ID,buffer);
    if(len)
    {
        buffer[len]='\0';
        if(!strcmp((char *)phone,(char *)buffer))
        {
            return 1;//呼入/呼出
        }
    }
    /////监听电话号码////////////
    len = EepromPram_ReadPram(E2_MONITOR_PHONE_ID,buffer);
    if(len)
    {
        buffer[len]='\0';
        if(!strcmp((char *)phone,(char *)buffer))
        {
            return 2;//呼入/呼出
        }
    }
    /////////////////////
    len = EepromPram_ReadPram(E2_TERMINAL_RESET_PHONE_ID,buffer);//终端复位电话号码
    if(len)
    {
        buffer[len]='\0';
        if(!strcmp((char *)phone,(char *)buffer))
        {
            return 3;
        }
    }
    len = EepromPram_ReadPram(E2_TERMINAL_DEFAULT_SET_PHONE_ID,buffer);//恢复出厂设置电话号码
    if(len)
    {
        buffer[len]='\0';
        if(!strcmp((char *)phone,(char *)buffer))
        {
            return 4;
        }
    }
    return 0;
}
*/
/*************************************************************
** 函数名称: Public_CheckPhoneInformation
** 功能描述: 检查电话号码,已根据通话时长判断电话簿以外的号码,(监听电话号码、热线电话号码不受任何限制)
** 入口参数: phone：需要检查的电话号码首地址； 
** 出口参数: name：返回的联系人姓名
** 返回参数: 0:禁止呼入/呼出；1: 呼入；2: 呼出；3：呼入/呼出 
** 全局变量: 无
** 调用模块: CheckPhoneInformation,
*************************************************************/
/*
unsigned char Public_CheckPhoneInformation(unsigned char *phone,unsigned char *name)
{
    unsigned char flag;
    flag=Public_CheckPhoneIsSpecialNumber(phone);
    #ifdef USE_PHONE
    Phone_SetPhoneSpecialFlag(flag);
    #endif
    if(1 == flag)//监控平台电话号码
    {
        strcpy((char *)name,"客服中心");
        return 3;//呼入/呼出
    }
    else
    if(2 == flag)//监听电话
    {
        strcpy((char *)name,"监听电话");
        return 3;//呼入/呼出
    }
    else
    if(3 == flag)//是终端复位电话号码
    {
        strcpy((char *)name,"复位电话");
        if(s_ucNewCallPhoneFlag)
        Public_SetOperateTimer(NVIC_SystemReset,PUBLICSECS(3));
        return 3;//呼入/呼出
    }
    else
    if(4 == flag)//恢复出厂设置电话号码
    {
        strcpy((char *)name,"恢复出厂");
        if(s_ucNewCallPhoneFlag)
        Public_SetOperateTimer(EepromPram_DefaultSet,PUBLICSECS(2));
        return 3;//呼入/呼出
    }
    ///////检查是否属于行驶中禁止通话////////////
    if(Public_CheckIsPhoneServerRunStatus())
    {
        return 0;//
    }
    //////检查通话时长///////////////////
    #ifdef USE_PHONE 
    /////////每次通话时长////////////
    if(0==Phone_GetEachMaxTalkTime())
    {
        return 0;//禁止呼入/呼出
    }
    ////////////每月通话时长/////////////// 
    if(Phone_GetOverMonthTalkTimeFlag())//获得超过当月通话时间标志
    {
        return 0;//禁止呼入/呼出
    }
    #else
    unsigned char buffer[30];
    /////////每次通话时长////////////
    if(EepromPram_ReadPram(E2_MAX_PHONE_TIME_EACH_ID,buffer))
    {
        if(0==Public_ConvertBufferToLong(buffer))
        {
            return 0;//禁止呼入/呼出
        }
    }
    ////////////每月通话时长/////////////// 
    if(EepromPram_ReadPram(E2_MAX_PHONE_TIME_MONTH_ID,buffer))
    {
        if(0==Public_ConvertBufferToLong(buffer))
        {
            return 0;//禁止呼入/呼出
        }
    }
    #endif
    ///////在没有电话簿的情况下允许通话/////////////////
    if(0==Message_GetPhoneBookTotalNum())
    {
        flag = 3;
        strcpy((char *)name,"未知");
        return flag;//呼入/呼出 
    }
    ////////由电话簿属性决定////////////////
    return CheckPhoneInformation(phone,name);//0：没有该电话号码的资料；1: 呼入；2: 呼出；3：呼入/呼出
}
*/
/*************************************************************
** 函数名称: Public_DisposePhoneStatus
** 功能描述: 处理电话状态命令
** 入口参数: phone:电话号码,status:电话状态：0：为挂断;1:接通;2:新来电;
** 出口参数: 无
** 返回参数: 如果是电话呼入状态为新来电时,返回值:0:直接拒接来电;1:正在等待用户接听来电
** 全局变量: 无
** 调用模块: 无
*************************************************************/
/*
unsigned char Public_DisposePhoneStatus(unsigned char *phone,unsigned char status)
{
    unsigned char result;
    result = 0;
    s_ucNewCallPhoneFlag = 0;
    if(2 == status)s_ucNewCallPhoneFlag = 1;
    #ifdef USE_PHONE_BOOK
    #ifdef USE_NAVILCD
    if(NaviLcd_GetCurOnlineStatus())
    result = NaviLcd_DisposePhoneStatus(phone,status);
    #endif
    result = PhoneBook_DisposePhoneStatus(phone,status);
    #else
    #ifdef USE_NAVILCD
    result = NaviLcd_DisposePhoneStatus(phone,status); 
    #endif 
    #endif
    #ifdef USE_PHONE
    Phone_DisposePhoneStatus(phone,status);
    #endif
    s_ucNewCallPhoneFlag = 0;
    return result;
}
*/
/*************************************************************
** 函数名称: ShowStartLogo
** 功能描述: 
** 入口参数: 无
** 出口参数: 无
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/
/*
void Public_SaveCurSIMICcidNumberToE2Param(void)
{
    unsigned char data[20]={0}; 
    MOD_GetIccidBcdValue(data);
    EepromPram_WritePram(E2_SIM_ICCID_NUMBER_ID,data,E2_SIM_ICCID_NUMBER_ID_LEN);
}
*/
/*************************************************************
** 函数名称: Public_CheckSystemLogoAndVerSion
** 功能描述: 检验终端产品名称、产品版本号是否正确(2字节公司标志,8字节型号,2字节PCB版本,6字节版本号,4字节校验码)
** 入口参数: 附加信息首地址,crc
** 出口参数: 无
** 返回参数:  1:检验正确,0:检验出错
** 全局变量: 
** 调用模块: 
*************************************************************/	
/*dxl,2015.8
unsigned char Public_CheckSystemLogoAndVerSion(unsigned char *pBuffer,unsigned long *checkCRC)
{
    char readLogoModel[11];  
    char readVersion[7]; 
    unsigned char len;
    ///////////2字节公司标志,8字节型号,2字节PCB版本,6字节版本号,4字节校验码 
    ///////////////////
    memcpy(readLogoModel,pBuffer,10);//EIEGS702
    memcpy(readVersion,pBuffer+12,6);//021101  
    /////////////
    *checkCRC = Public_ConvertBufferToLong(&pBuffer[18]); 
    /////////////////////////////////
    #ifdef __VERSION_H_//EGS702
    char curLogoModel[11];  
    char curVersion[7];    
    ///////////////////
    len=Version_GetEquipmentCompany(curLogoModel);
    Version_GetProductSeriesName(&curLogoModel[len]);
    Version_GetEquipmentSoftVer(curVersion);
    //比较公司LOGO和产品型号
    if(0 != strncmp(readLogoModel,curLogoModel,8))
    {
        return 0;//        
    }
    //////////////////
    if(0 != strncmp(readVersion,curVersion,4))
    {
        if(0 != strncmp(readVersion,"0220",4))return 0;
    }
    #else//EGS701
    if(0 != strncmp(readLogoModel+2,PRODUCT_MODEL+14,6))
    {
        return 0;//        
    }
    #endif
    ////////////////////
    //写升级类型,dxl,2014.6.14
    #ifdef FRAM_FIRMWARE_UPDATA_TYPE_ADDR
    len = 0;
    FRAM_BufferWrite(FRAM_FIRMWARE_UPDATA_TYPE_ADDR, &len, FRAM_FIRMWARE_UPDATA_TYPE_LEN);
    #endif
    return 1;
}
*/
/*************************************************************
** 函数名称: Public_CheckPeripheralUpdataType
** 功能描述: 检验外设产品名称是否正确(2字节公司标志,8字节型号,2字节PCB版本,6字节版本号,4字节校验码
** 入口参数: 附加信息首地址,crc
** 出口参数: 无
** 返回参数: 1:检验正确,0:检验出错
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char Public_CheckPeripheralUpdataType(unsigned char *pBuffer,unsigned char *type)
{
    #ifndef __VERSION_H_
    if(0 == strncmp((char const *)pBuffer+2,"EICZ    ",4))//检测产品型号dxl,2014.6.14
    {
        *type = 0x09;
        #ifdef FRAM_FIRMWARE_UPDATA_TYPE_ADDR
        FRAM_BufferWrite(FRAM_FIRMWARE_UPDATA_TYPE_ADDR, type, FRAM_FIRMWARE_UPDATA_TYPE_LEN);
        #endif
        return 1;
    }
    #endif    
    return 0;
}
/*************************************************************
** 函数名称: Public_CheckTerminalAndPeripheralVerify
** 功能描述: 检验终端、外设产品名称、产品版本号是否正确(2字节公司标志,8字节型号,2字节PCB版本,6字节版本号,4字节校验码)
** 入口参数: 附加信息首地址,checkCRC返回值,type升级类型返回值
** 出口参数: 无
** 返回参数: 1:检验正确,0:检验出错
** 全局变量: 
** 调用模块: 
*************************************************************/	
/*
unsigned char Public_CheckTerminalAndPeripheralVerify(unsigned char *pBuffer,unsigned long *checkCRC,unsigned char *type)
{    
    *type = 0;
    ///////是否是终端升级///////////////////
    if(Public_CheckSystemLogoAndVerSion(pBuffer,checkCRC))
    {
        return 1;
    }
    ///////是否是外设升级///////////////////
    if(Public_CheckPeripheralUpdataType(pBuffer,type))
    {
        return 1;
    }
    ///////////////////
    return 0;
}
*/
/*************************************************************
** 函数名称: Public_ParameterInitialize
** 功能描述: 参数初始化
** 入口参数: 
** 出口参数: 无
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
/*
void Public_ParameterInitialize(void)
{
    LZM_PublicKillTimerAll(s_stPUBLICTimer,PUBLIC_TIMERS_MAX);  
    ///////////////////////
    SetTimerTask(TIME_PUBLIC,LZM_TIME_BASE);
    ////////////////////////
    //Public_SetOperateTimer(Public_SaveCurSIMICcidNumberToE2Param,PUBLICSECS(50));
    //////////////////////////  
    #ifdef USE_PHONE
    Phone_ParamInitialize();
    #endif
    ///////////////////////
}
*/
/************************************************************
** 函数名称: Public_SetOperateTimer
** 功能描述: 
** 入口参数:
** 出口参数:
************************************************************/ 
void Public_SetOperateTimer(void (*function)(void),LZM_TIMER32 time)
{
    LZM_PublicSetOnceTimer(&s_stPUBLICTimer[PUBLIC_TIMER_OPERATE],time,function);
}
/************************************************************
** 函数名称: Public_SetEIExpandTimer
** 功能描述: 
** 入口参数:
** 出口参数:
************************************************************/ 
void Public_SetEIExpandTimer(void (*function)(void),LZM_TIMER32 time)
{
    LZM_PublicSetOnceTimer(&s_stPUBLICTimer[PUBLIC_TIMER_EIEXPAND],time,function);
}
/************************************************************
** 函数名称: Public_SetTestTimer
** 功能描述: 
** 入口参数:
** 出口参数:
************************************************************/ 
void Public_SetTestTimer(void (*function)(void),LZM_TIMER32 time)
{
    LZM_PublicSetOnceTimer(&s_stPUBLICTimer[PUBLIC_TIMER_TEST],time,function);
}

/************************************************************
** 函数名称: Public_SetTaskTimer
** 功能描述: 
** 入口参数:
** 出口参数:
************************************************************/ 
void Public_SetTaskTimer(void (*function)(void),LZM_TIMER32 time)
{
    LZM_PublicSetOnceTimer(&s_stPUBLICTimer[PUBLIC_TIMER_TASK],time,function);
}
/*************************************************************
** 函数名称: LZM_PublicTimerTask
** 功能描述: 公共定时器处理函数(对时间要求不是很高的且执行占用的时间不会很长)
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
FunctionalState LZM_PublicTimerTask(void)
{
    LZM_PublicTimerHandler(s_stPUBLICTimer,PUBLIC_TIMERS_MAX);
    #ifdef USE_PHONE
    Phone_TimeTask();
    #endif
    return ENABLE;
}

/********************************************************************************
 *                            End of File
 *******************************************************************************/
